In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [3]:
casts = pd.read_csv(r'C:\Users\HP\Desktop\cast.csv')

In [5]:
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [6]:
title = pd.read_csv(r'C:\Users\HP\Desktop\titles.csv')

In [7]:
title.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [9]:
casts.size

450006

In [10]:
casts.shape

(75001, 6)

In [11]:
title.shape

(50000, 2)

In [12]:
t = title['title']

In [13]:
t

0                 The Rising Son
1        The Thousand Plane Raid
2               Crucea de piatra
3                        Country
4                     Gaiking II
                  ...
49995                      Rebel
49996                    Suzanne
49997                      Bomba
49998       Aao Jao Ghar Tumhara
49999                 Mrs. Munck
Name: title, Length: 50000, dtype: object

In [15]:
title.loc[0]

title    The Rising Son
year               1990
Name: 0, dtype: object

In [17]:
new1 =casts.loc[0]

In [18]:
new1

title        Closet Monster
year                   2015
name               Buffy #1
type                  actor
character           Buffy 4
n                      31.0
Name: 0, dtype: object

In [28]:
new1 =pd.DataFrame(new1)

In [30]:
#filter greater than year 1985
year1985 = title[title['year'] > 1985]

In [31]:
year1985

                  title  year
0        The Rising Son  1990
2      Crucea de piatra  1993
3               Country  2000
4            Gaiking II  2011
5           Medusa (IV)  2015
...                 ...   ...
49990           Junebug  2005
49993    Corruption.Gov  2010
49996           Suzanne  1996
49997             Bomba  2013
49999        Mrs. Munck  1995

[29814 rows x 2 columns]

In [32]:
# filter
t=title
mid = t[(t['year']>= 1982) & (t['year']< 2012)]

In [56]:
mid.sort_values('year', ascending=True)

                               title  year
29546                    La traviata  1982
19245              Dan zhi shen gong  1982
19249                Da dao luo wang  1982
7925        Huet chin gwai heung liu  1982
10886               Xiao sheng pa pa  1982
...                              ...   ...
24647                 Fertile Ground  2011
47023                 Henry's Future  2011
28420  God's Faithful Servant: Barla  2011
2910                           Curse  2011
41906                   Big Boy (II)  2011

[19534 rows x 2 columns]

In [57]:
equa = casts[casts['name'] == '$hutter'].sort_index()

In [58]:
equa

                    title  year     name   type                character     n
2     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan  10.0
3    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan   NaN
4              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron   NaN
5  Straight Outta Compton  2015  $hutter  actor              Club Patron   NaN
6  Straight Outta Compton  2015  $hutter  actor                  Dopeman   NaN

In [59]:
equa.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [63]:
equa =equa[['title', 'year', 'name', 'type', 'character']]

In [64]:
equa

                    title  year     name   type                character
2     Battle of the Sexes  2017  $hutter  actor          Bobby Riggs Fan
3    Secret in Their Eyes  2015  $hutter  actor          2002 Dodger Fan
4              Steve Jobs  2015  $hutter  actor  1988 Opera House Patron
5  Straight Outta Compton  2015  $hutter  actor              Club Patron
6  Straight Outta Compton  2015  $hutter  actor                  Dopeman